---
title: "Wordpress inaccessible after apt-get install ?"
date: 2010-11-01
forum: New to Ubuntu
---

### Post by albertwt on 2010-11-01
Hi All,

I've installed the following items:

 apt-get install apache2
 apt-get install mysql-server-5.1

```
root@wp-companyweb01:/home/administrator# apt-get install wordpress
Reading package lists... Done
Building dependency tree
Reading state information... Done
The following extra packages will be installed:
  libjs-cropper libjs-prototype libjs-scriptaculous libphp-phpmailer
  libphp-snoopy php-gettext tinymce wordpress-l10n
Suggested packages:
  mail-transport-agent curl
The following NEW packages will be installed:
  libjs-cropper libjs-prototype libjs-scriptaculous libphp-phpmailer
  libphp-snoopy php-gettext tinymce wordpress wordpress-l10n
0 upgraded, 9 newly installed, 0 to remove and 24 not upgraded.
Need to get 7,890kB of archives.
After this operation, 29.5MB of additional disk space will be used.
Do you want to continue [Y/n]? Y
Get:1 http://au.archive.ubuntu.com/ubuntu/ lucid/universe libjs-prototype 1.6.1-1 [34.9kB]
Get:2 http://au.archive.ubuntu.com/ubuntu/ lucid/universe libjs-scriptaculous 1.8.3-1 [127kB]
Get:3 http://au.archive.ubuntu.com/ubuntu/ lucid/universe libjs-cropper 1.2.1-1 [136kB]
Get:4 http://au.archive.ubuntu.com/ubuntu/ lucid/universe libphp-phpmailer 5.1-1 [77.0kB]
Get:5 http://au.archive.ubuntu.com/ubuntu/ lucid/universe libphp-snoopy 1.2.4-1 [15.3kB]
Get:6 http://au.archive.ubuntu.com/ubuntu/ lucid/universe php-gettext 1.0.9-1 [15.9kB]
Get:7 http://au.archive.ubuntu.com/ubuntu/ lucid/universe tinymce 3.2.7-1 [442kB]
Get:8 http://au.archive.ubuntu.com/ubuntu/ lucid/universe wordpress 2.9.2-1ubuntu1 [2,017kB]
Get:9 http://au.archive.ubuntu.com/ubuntu/ lucid/universe wordpress-l10n 2.9.2-1ubuntu1 [5,025kB]
Fetched 7,890kB in 38s (203kB/s)
Selecting previously deselected package libjs-prototype.
(Reading database ... 48847 files and directories currently installed.)
Unpacking libjs-prototype (from .../libjs-prototype_1.6.1-1_all.deb) ...
Selecting previously deselected package libjs-scriptaculous.
Unpacking libjs-scriptaculous (from .../libjs-scriptaculous_1.8.3-1_all.deb) ...
Selecting previously deselected package libjs-cropper.
Unpacking libjs-cropper (from .../libjs-cropper_1.2.1-1_all.deb) ...
Selecting previously deselected package libphp-phpmailer.
Unpacking libphp-phpmailer (from .../libphp-phpmailer_5.1-1_all.deb) ...
Selecting previously deselected package libphp-snoopy.
Unpacking libphp-snoopy (from .../libphp-snoopy_1.2.4-1_all.deb) ...
Selecting previously deselected package php-gettext.
Unpacking php-gettext (from .../php-gettext_1.0.9-1_all.deb) ...
Selecting previously deselected package tinymce.
Unpacking tinymce (from .../tinymce_3.2.7-1_all.deb) ...
Selecting previously deselected package wordpress.
Unpacking wordpress (from .../wordpress_2.9.2-1ubuntu1_all.deb) ...
Selecting previously deselected package wordpress-l10n.
Unpacking wordpress-l10n (from .../wordpress-l10n_2.9.2-1ubuntu1_all.deb) ...
Setting up libjs-prototype (1.6.1-1) ...
Setting up libjs-scriptaculous (1.8.3-1) ...
Setting up libjs-cropper (1.2.1-1) ...
Setting up libphp-phpmailer (5.1-1) ...
Setting up libphp-snoopy (1.2.4-1) ...
Setting up php-gettext (1.0.9-1) ...
Setting up tinymce (3.2.7-1) ...

Setting up wordpress (2.9.2-1ubuntu1) ...

Setting up wordpress-l10n (2.9.2-1ubuntu1) ...
root@wp-companyweb01:/home/administrator#

```

however when I tried to access it with the following URL, it failed: 

```
http://wp-companyweb01/wordpress/wp-admin/install.php
``` 

nothing comes up ?

Any kind of help would be greatly appreciated.

Thanks

---

### Post by wishyjr on 2010-11-01
hmm could be a permissions issue. Did you get any error message at all when accessing the page via a web browser? 

If you didn't (i.e. you get a completely white screen), there's a good chance the issue may be php related.

also, i notice that you installed mySQL on there, did you create a database for wordpress along with a SQLuser to access it?

maybe try this: [http://codex.wordpress.org/Installing_WordPress#Famous_5-Minute_Install]("http://codex.wordpress.org/Installing_WordPress#Famous_5-Minute_Install")

cheers
wishy

---

### Post by albertwt on 2010-11-01
thanks man for the help, I'll follow through the site installation instruction then.

---

### Post by wishyjr on 2010-11-01
no problem, hope you get it sorted. let us know if you have any more questions

---

